from datetime import date, datetime, timedelta
import calendar


def current_time():
    from datetime import datetime

    now = datetime.now()

    print("____________________________________________________________________________________")
    print("\nВРЕМЯ НА ДАННЫЙ МОМЕНТ:")
    print(now.strftime("%Y-%m-%d"))  # дата
    print(now.strftime("%H:%M:%S"))  # время
    print(now.strftime("%A\n"))  # день недели
    print("____________________________________________________________________________________")



def Time_difference():

    first = int(input("\nВведите часы первого времени:  "))
    second = int(input("Введите минуты первого временеи: "))

    first_2 = int(input("Введите часы второго времени:  "))
    second_2 = int(input("Введите минуты второго времени: "))

    total_minuts = abs((first * 60 + second) - (first_2 * 60 + second_2))

    print("____________________________________________________________________________________")
    print(f"Разница между временнами {total_minuts} минут")
    print("____________________________________________________________________________________")


def time_left():

    now = datetime.now()
    midnight = datetime.combine(now.date() + timedelta(days=1), datetime.min.time())

    delta = midnight - now
    print("____________________________________________________________________________________")
    print(f"ДО ПОЛУНОЧИ ОСТАЛОСЬ: {delta}")
    print("____________________________________________________________________________________")



def next_data():

    today = date.today()
    print("____________________________________________________________________________________")
    print("\nХотите узнать сколько дней до вашей даты?")
    print("Сегодняшняя дата:")
    print(today.strftime("%d-%m-%Y"))

    print("____________________________________________________________________________________")
    data = input("Введите число: ")
    data_2 = input("Введите месяц: ")
    data_3 = input("Введите год: ")


    user_input = f"{data}-{data_2}-{data_3}"

    user_date = datetime.strptime(user_input, "%d-%m-%Y").date()


    delta = user_date - today

    print("____________________________________________________________________________________")
    print(f"До выбранной даты осталось: {delta.days} дней")
    print("____________________________________________________________________________________")

def leap_year():

    print("____________________________________________________________________________________")
    print("Давайте определим, высокосный ли год!")
    year = int(input("Введите год: "))
    if year % 4 == 0:
        print("____________________________________________________________________________________")
        print(f" {year} высокосный ")
        print("____________________________________________________________________________________")
    else:
        print("____________________________________________________________________________________")
        print(f" {year} не высокосный ")
        print("____________________________________________________________________________________")

def conversion():

    now = datetime.now()

    print("____________________________________________________________________________________")
    print(now.strftime("%d.%m.%Y"))
    print("____________________________________________________________________________________")

